Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/apisupport-omegat.tmx
Source language: en_us
Languages: pt_br

source: Defines a project type for NetBeans modules, useful for developing plug-in extensions for NetBeans.
pt_br: Define um tipo de projeto para módulos do NetBeans, que é útil para o desenvolvimento de extensões para o NetBeans.

source: Includes many wizards, samples, refactoring and other features.
pt_br: Inclui vários assistentes e outros recursos.

source: See Help | Contents for details, including recent changes.
pt_br: Veja Ajuda | Conteúdo da ajuda para detalhes, incluindo mudanças recentes.

source: NetBeans Plugin Development
pt_br: Desenvolvimento de plugin do netBeans

source: Module Reload Ant Task
pt_br: Módulo Tarefa Ant para Recarregamento

source: Developing NetBeans
pt_br: Desenvolvendo o NetBeans

source: Permits reloading of NetBeans modules using Ant.
pt_br: Permite recarregar módulos NetBeans utilizando Ant.

source: Provides a special task <nbinstaller> which permits module reloading to be triggered by the Ant script rather than the IDE GUI.
pt_br: Fornece uma tarefa especial <nbinstaller> que permite que o recarregamento de módulos seja disparado pelo script do Ant em vez de pela interface gráfica do IDE.

source: Used by Install/Reload in Development IDE.
pt_br: Utilizado por Instalar/Recarregar na IDE de Desenvolvimento.

source: Install/Reload in Target Platform uses a --reload command-line parameter and does not rely on this module.
pt_br: Instalar/Recarregar na Plataforma de Destino utiliza um parâmetro de linha de comando --reload e não se apóia nesse módulo.

source: Module Build Harness
pt_br: Infra-estrutura para Contrução de Módulos

source: Lets you build external plug-in modules from sources.
pt_br: Permite que sejam criados módulos externos de plug-ins a partir de código-fonte.

source: This is the build harness used to develop NetBeans modules (with or without the IDE).
pt_br: Este é o construtor harness utilizado para desenvolver módulos para o NetBeans (com ou sem o IDE).

source: It is normally used implicitly by NetBeans module projects.
pt_br: É normalmene utilizado implicitamente pelos projetos de módulos do NetBeans.

source: For technical documentation, see harness/README.
pt_br: Para documentação técnica, veja harness/README.

source: NetBeans Module Refactoring
pt_br: Refatoração de Módulo do NetBeans

source: Additional refactoring support for NetBeans module projects.
pt_br: Suporte adicional a refatoração para projetos de módulo do NetBeans.

source: Makes refactoring operations aware of NetBeans module semantics.
pt_br: Faz com que operações de refatoração reconheçam a semântica de módulos do NetBeans.

source: Currently supports Where Used queries and checks for class usages in manifest.mf and META-INF/services.
pt_br: Atualmente suporta consultas "Quando usado" e verifica a utilização de classes em manifest.mf e META-INF/services.

source: <b>{0}</b> implements a global lookup service.
pt_br: <b>{0}</b> implementa um serviço global de lookup.

source: Section {1}: <b>{0}</b>
pt_br: Seção {1}: <b>{0}</b>

source: Path: {0} Attribute: <b>{1}</b>
pt_br: Caminho: {0} Atributo: <b>{1}</b>

source: Path: <b>{0}</b>
pt_br: Caminho: <b>{0}</b>

source: Path: {0} Attribute: {1} Value: <b>{2}</b>
pt_br: Caminho: {0} Atributo: {1} Valor: <b>{2}</b>

source: {0} implements a global lookup service, update.
pt_br: {0} implementa um serviço global de lookup, atualizar.

source: Update {1}: {0}
pt_br: Atualizar {1}: {0}

source: Update section {1}: {0}
pt_br: Seção de atualização {1}: {0}

source: Change layer attribute value <b>{0}</b>
pt_br: Alterar valor de atributo de camada <b>{0}</b>

source: Rename layer file <b>{0}</b>
pt_br: Renomear arquivo de camada <b>{0}</b>

source: {0} implements a global lookup service, remove.
pt_br: {0} implementa um serviço global de lookup, remover.

source: Delete {1}: {0}
pt_br: Excluir {1}: {0}

source: Delete section {1}: {0}
pt_br: Excluir seção {1}: {0}

source: Delete layer entry for <b>{0}</b>
pt_br: Excluir entrada de camada para <b>{0}</b>

source: Illustrates how to use the NetBeans Platform to create your own application.
pt_br: Ilustra como utilizar o NetBeans Platform para criar sua própria aplicação.

source: See the PaintApp Tutorial for details.
pt_br: Veja o tutorial PaintApp para detalhes.

source: Create a new Paint Application project
pt_br: Criar um novo projeto Aplicativo Paint

source: Sample paint application based on the NetBeans platform.
pt_br: Exemplo de um aplicativo de desenho baseado na plataforma NetBeans.

source: PaintApp Platform Sample
pt_br: Exemplo da Plataforma PaintApp

source: Sample NetBeans platform application.
pt_br: Exemplo de aplicação da plataforma Netbeans.

source: Paint Application
pt_br: Aplicativo Paint

source: {0} of {1}
pt_br: {0} de {1}

source: Project &Name:
pt_br: &Nome do Projeto:

source: Project Folder already exists and is not empty.
pt_br: Diretório do Projeto já existe e não está vazio.

source: Project Folder cannot be created.
pt_br: Pasta do Projeto não pode ser criada.

source: Project Folder is not a valid path.
pt_br: Pasta do Projeto não é um caminho válido.

source: Project Name is not a valid folder name.
pt_br: Nome do Projeto não é um nome de pasta válido.

source: Select Project Location
pt_br: Selecionar Local do Projeto

source: Project &Folder:
pt_br: Pasta &do Projeto:

source: Br&owse...
pt_br: Pr&ocurar...

source: Project &Location:
pt_br: &Localização do Projeto:

source: See the FeedReader Tutorial for details.
pt_br: Veja o tutorial FeedReader para detalhes.

source: Bundles a New Project sample for "FeedReader", an application built atop the NetBeans Platform.
pt_br: Inclui uma amostra de Novo Projeto para o "FeedReader", uma aplicação construída sobre a Plataforma NetBeans.

source: Demonstrates a complete module suite with one functional module and several third-party libraries.
pt_br: Demonstra uma suíte completa de módulos com um módulo funcional e várias bilblotecas de terceiros.

source: Shows how to use settings, window manipulation, actions, and more.
pt_br: Demonstra como usar configurações, manipular janelas, trabalhar com ações, e mais.

source: FeedReader Platform Application Sample
pt_br: FeedReader: Amostra de Aplicação baseada no NetBeans Platform

source: Bundles a demonstration application using the NetBeans Platform.
pt_br: Incluir uma aplicação de demonstração usando o NetBeans Platform.

source: NetBeans Modules
pt_br: Módulos do NetBeans

source: Project Fol&der:
pt_br: Pasta &do Projeto:

source: Create a new FeedReader project
pt_br: Criar um novo projeto Feedreader

source: Timers API
pt_br: API de Timers

source: Run-time watches
pt_br: Executa observadores

source: Run-time Watches
pt_br: Executa Observadores

source: NetBeans Module Projects
pt_br: Projetos de Módulos do NetBeans

source: Defines an Ant-based project type for NetBeans modules and module suites.
pt_br: Define um tipo de projeto baseado no Ant para suítes de módulos do NetBeans.

source: Includes many wizards and other features.
pt_br: Inclui vários assistentes e outros recursos.

source: Source Packages
pt_br: Pacotes de Código-fonte

source: Unit Test Packages
pt_br: Pacotes de Testes Unitários

source: Functional Test Packages
pt_br: Pacotes de Testes Funcionais

source: Performance Test Packages
pt_br: Pacotes de Testes de Desempenho

source: {0} Test Packages
pt_br: {0} Pacotes de Testes

source: This version of the IDE is too old to read metadata in {0}.
pt_br: Essa versão da IDE é muito antiga para ler metadata em {0}.

source: Invalid Platform ({0})
pt_br: Plataforma Inválida ({0})

source: {0} (Default)
pt_br: {0} (Padrão)

source: 5.0 update 1 / 5.5
pt_br: 5.0 atualizar 1 / 5.5

source: 5.5 update 1
pt_br: 5.5 atualizar 1

source: unknown
pt_br: desconhecido

source: No Public Packages
pt_br: Sem Pacotes Públicos

source: <html>Javadoc cannot be produced for this module.<br>It is not yet configured to export any packages to other modules.
pt_br: <html>Javadoc não pode ser processado por esse módulo.<br>O módulo ainda não está configurado para exportar pacotes para outros módulos.

source: Configure Public Packages...
pt_br: Configurar Pacotes Públicos...

source: Harness Too Old
pt_br: Arreio Muito Antigo

source: You are attempting to build a module or suite project which uses a new metadata format with an old version of the module build harness which does not understand this format.
pt_br: Você está tentando construir um módulo ou um projeto de suíte que usa usa um novo formato de metadata com uma versão antiga de construção de módulo de arreio que não entende esse formato.

source: You may either choose a newer NetBeans platform, or switch the harness used by the selected platform to use a newer harness (try using the harness supplied with the IDE).
pt_br: Voce deve escolher uma nova plataforma NetBeans, ou mudar o arreio usado na plataforma selecionada para usar um novo arreio(tente usar o arreio sugerido com a IDE).

source: Build
pt_br: Construir

source: Clean and Build
pt_br: Limpar e Construir

source: Clean
pt_br: Limpar

source: Build with Dependencies
pt_br: Construir com Dependências

source: Build with Dependencies and Try
pt_br: Construir com Dependências e Testar

source: Run
pt_br: Executar

source: Debug
pt_br: Deburar

source: Test
pt_br: Testar

source: Generate Javadoc
pt_br: Gerar Javadoc

source: Generate Architecture Description
pt_br: Gerar Descrição de Arquitetura

source: Check for Unused Bundle Keys
pt_br: Verificar Chaves de Bundle Não-usadas

source: Install/Reload in Target Platform
pt_br: Instalar/Recarregar na Plataforma de Destino

source: Install/Reload in Development IDE
pt_br: Instalar/Recarregar no IDE de Desenvolvimento

source: Create NBM
pt_br: Criar NBM

source: <html>Reloading a module in the running development IDE can be dangerous.<br>Errors in the module could corrupt your environment and force you to use a new user directory.<br>(In most cases it is wiser to use <b>Install/Reload in Target Platform</b>.)<br>Do you really want to reload this module in your own IDE?
pt_br: <html>Recarregar um módulo em execução na IDE pode ser perigoso.<br>Erros no módulo poderão corromper seu ambiente e forçar a usar um novo diretório de usuário.<br>(Em muitos casos é mais sensato ao usuário <b>Instalar/Recarregar uma Plataforma de Destino</b>.)<br>Você realmente quer recarregar esse módulo na sua própria IDE?

source: Confirm Install/Reload in Development IDE
pt_br: Confirmar Instalação/Recarregamento no IDE de Desenvolvimento

source: Run {0} Tests
pt_br: Executar {0} Testes

source: Run {0} Test Dist
pt_br: Executar Teste de Distribuição {0}

source: Build {0} Tests
pt_br: Construir {0} Testes

source: Measure {0} Test Coverage
pt_br: Construir {0} Cobertura de Testes

source: Cannot perform the operation while the module is being run/debugged;either exit the IDE being run or kill any running process and delete lock file if necessary.
pt_br: Não pode realizar a operação enquanto o módulo estiver executando/depurando;saia da IDE em execução ou encerre algum processo em execução e exclua o arquivo travado, se necessário.

source: Module project in {0}
pt_br: Projeto de módulo em {0}

source: Extra Javadoc Files
pt_br: Arquivos Javadoc Adicionais

source: Important Files
pt_br: Arquivos Importantes

source: Libraries
pt_br: Bibliotecas

source: Unit Test Libraries
pt_br: Bibliotecas de Testes Unitários

source: Module Manifest
pt_br: Manifesto do Módulo

source: Architecture Description
pt_br: Descrição de Arquitetura

source: API Changes
pt_br: Mudanças de API

source: Javadoc Overview
pt_br: Visão Geral do Javadoc

source: Build Script
pt_br: Script de Construção

source: Project Metadata
pt_br: Metadados do Projeto

source: Project Properties
pt_br: Propriedades do Projeto

source: Per-user Project Properties
pt_br: Propriedades do Projeto Específicas a cada Usuário

source: Suite Locator
pt_br: Localizador da Suíte

source: Per-user Suite Locator
pt_br: Localizador de Suíte para cada Usuário

source: NetBeans Platform Config
pt_br: Configuração da Plataforma do NetBeans

source: Per-user NetBeans Platform Config
pt_br: Configuração da Plataforma do NetBeans para cada usuário

source: Add Module Dependency...
pt_br: Adicionar Dependência de Módulo...

source: Add Module Dependency
pt_br: Adicionar Dependência de Módulo

source: Edit...
pt_br: Editar...

source: Edit "{0}" Dependency
pt_br: Editar Dependência "{0}"

source: Open
pt_br: Abrir

source: Remove
pt_br: Remover

source: Broken platform ''{0}''
pt_br: Plataforma inválida ''{0}''

source: Broken platform
pt_br: Plataforma inválida

source: Javadoc for {0} not found.
pt_br: Javadoc para {0} não encontrado.

source: Show Javadoc
pt_br: Exibir Javadoc

source: Implementation Dependency
pt_br: Depende de Implementação

source: Needed to <strong>compile</strong>
pt_br: Necessita <strong>compilar</strong>

source: Major release version: <strong>{0}</strong>
pt_br: Versão principal da liberação: <strong>{0}</strong>

source: Specification version: <strong>{0}</strong>
pt_br: Versão da Especificação: <strong>{0}</strong>

source: Include also tests of module
pt_br: Incluir também testes de módulo

source: Compile-time dependency
pt_br: Compilação de dependência

source: Include dependencies recursively
pt_br: Incluir dependencias recursivamente

source: Add Unit Test Dependency
pt_br: Adicionar Dependência de Teste Unitário

source: Build All
pt_br: Construir Tudo

source: Clean and Build All
pt_br: Limpar e Construir Tudo

source: Clean All
pt_br: Limpar Tudo

source: Build ZIP Distribution
pt_br: Construir Distribuição ZIP

source: Build JNLP Application
pt_br: Construir Aplicação JNLP

source: Run JNLP Application
pt_br: Executar Aplicação JNLP

source: Debug JNLP Application
pt_br: Depurar Aplicação JNLP

source: Create NBMs
pt_br: Criar NBMs

source: Build Mac OS X Application
pt_br: Construir Aplicação Mac OS X

source: New Library Wrapper Module Project
pt_br: Novo Projeto de Módulo de Encapsulador de Bibliotecas

source: Module "{0}" is already part of the module suite "{1}" [{2}].
pt_br: O módulo "{0}" já faz parte da suíte de módulos "{1}" [{2}].

source: Do you wish to remove the module from that suite and add it to "{3}" instead?
pt_br: Deseja remover o módulo desta suíte e adicioná-lo a "{3}" em vez disso?

source: Suite "{0}" already contains selected project "{1}".
pt_br: Suíte "{0}" já contém o projeto selecionado "{1}".

source: The project "{0}" is part of a netbeans.org CVS tree.
pt_br: O projeto "{0}" faz parte de uma árvore CVS de netbeans.org.

source: As such it cannot be added as a suite component.
pt_br: Portanto não pode ser adicionado como um componente da suíte.

source: The project "{0}" is not a NetBeans module project.
pt_br: O projeto "{0}" não é um projeto de módulos do NetBeans.

source: You can only add NetBeans modules to a module suite.
pt_br: Somente pode-se adicionar módulos do NetBeans a uma suíte de módulos.

source: Add Existing...
pt_br: Adicionar Existente...

source: Add New Library...
pt_br: Adicionar Nova Biblioteca...

source: Add New...
pt_br: Adicionar Novo...

source: Modules
pt_br: Módulos

source: New Module Project
pt_br: Novo Projeto de Módulo

source: Open Project
pt_br: Abrir Projeto

source: Removing "{0}"
pt_br: Removendo "{0}"

source: Opening Selected Projects...
pt_br: Abrindo Projetos Selecionados...

source: <html>The module <b>{0}</b> is set as a dependency in the following modules.<br>{1}<br>By removing this module from the suite the dependencies on this module<br>will be removed as well.
pt_br: <html>O módulo <b>{0}</b> está definido com uma dependência no módulo seguinte.<br>{1}<br>Revomendo esse módulo da suíte de dependências esse módulo<br>também será removido.

source: The suite already contains a project with code name base "{0}".
pt_br: A suíte já contém um projeto com nome base de código "{0}".

source: Module suite project in {0}
pt_br: Projeto de Suite de Módulos {0}

source: JNLP Descriptor
pt_br: Descritor JNLP

source: <html>The JNLP application cannot be built because this suite is not yet set up as a standalone application.<br>At least a branding name must be configured before building or running in JNLP mode.
pt_br: <html>A aplicação JNLP não pode ser construída porque essa suíte ainda não foi configurada como uma aplicação independente.<br>Pelo menos um nome marcado deve ser configurado antes de construir ou executar em modo JNLP.

source: <html>The ZIP file cannot be built because this suite is not yet set up as a standalone application.<br>At least a branding name must be configured before building an application ZIP.
pt_br: <html>O arquivo ZIP não pode ser construída porque essa suíte ainda não foi configurada como uma aplicação independente.<br>Pelo menos um nome marcado deve ser configurado antes de construir uma aplicação ZIP.

source: Not Standalone Application
pt_br: Não é uma Aplicação Independente

source: Configure Application...
pt_br: Configurar Aplicação...

source: Incorrect icon size: {0}x{1} but expected {2}x{3}.
pt_br: Tamanho do ícone incorreto: {0}x{1} mas esperado {2}x{3}.

source: No Icon ({0}x{1}) selected.
pt_br: Nenhum ícone ({0}x{1}) selecionado.

source: Select Icon
pt_br: Selecionar Ícone

source: Selected icon [size]:
pt_br: Selecionar ícone [tamanho]:

source: Creates Generics Languages Framework nbs file for some specific mime type and file extensions.
pt_br: Criação de Linguagem Genérica de arquivo Framework nbs para apenas um tipo específico de mime e arquivos de extensão.

source: You can define support for many editing features (Syntax Coloring, Indentation, Code Folding, Navigator, ...) inside the nbs file.
pt_br: Você pode definir suporte para muitas edições(Sintaxe de Cor, Indentação, Pasta de Código, Navegador, ...)dentro do arquivo nbs.

source: Makes a new wizard that may be either registered as a New File wizard or called from a custom code (e.g. from an action representing global, popup menu, …).
pt_br: Faça um novo assistente que possa ser registrado com um outro Arquivo Novo assistente ou chamado de um código habitual (e.g. de uma ação global representada, menu de pop-up, …).

source: Creates a new NetBeans module which is just a wrapper for an existing JAR library.
pt_br: Criar um nvo módulo NetBeans que é apenas um invólucro para uma biblioteca JAR existente.

source: Other modules in the same suite can declare a dependency on the wrapper module to get shared access to library classes.
pt_br: Outros módulos na mesma suíte pode declarar dependência em um módulo invólucro para ter acesso compartilhado à classes de biblioteca.

source: Use this template to add a new class library to the Library Manager of the user’s IDE.
pt_br: Use esse modelo para adcionar uma nova classe de biblioteca para o Gerenciador de Bibliotecas para os usuários da IDE.

source: Select a library you have already defined in your own IDE.
pt_br: Selecione uma biblioteca que você já tenha definido em sua IDE.

source: You may include associated sources and/or Javadoc.
pt_br: Você deve incluir código associado e/ou Javadoc.

source: Use this template to include a new Options panel in this module.
pt_br: Use esse modelo para incluir um novo painel de Opções nesse módulo.

source: Creates a new empty NetBeans Module Suite.
pt_br: Cria um novo Módulo Suíte NetBeans vazio.

source: Use this template to add a class which manages the module installation (and uninstallation) lifecycle.
pt_br: Use esse modelo para adicionar uma classe que gerencie a instalação do módulo (e desinstale) o cicle de vida.

source: Use this template to register an Update Center with this module.
pt_br: Use esse modelo para registrar um Centro de Atualização com esse módulo.

source: An Update Descriptor (XML file) will be produced by Create NBMs... on a module suite context menu.
pt_br: Um Update Descriptor (arquivo XML) será producido porCriador NBMs... num menu contextual de suíte de módulo.

source: This XML file must be publicly accessible at some URL.
pt_br: Esse arquivo XML pode ser associado publicamento a alguma URL.

source: When the user installs a module with this template, the Auto Update wizard will automatically look in the specified update center.
pt_br: Quando o usuário instala um módulo com esse modelo, o assistente de Auto Atualização será automaticamente mostrado numa central específica de atualização.

source: Use this template to include JavaHelp in a module.
pt_br: Use esse modelo para incluir JavaHelp num módulo.

source: Declares a file type which will be recognized by NetBeans, e.g. in folder views.
pt_br: Declara um tipo de arquivo que será reorganizado pelo NetBeans, e.g. visualizador de pasta.

source: The DataObject is the main controller of the file type’s behavior.
pt_br: O DataObject é o controlador principal de tipos de arquivo de comportamento.

source: Creates a new singleton Window integrated into the Window System along with an Action in main menu that opens it.
pt_br: Crie uma nova Janela solitária integrada na Janela do Sistema ao longo de uma Action no menu principal que abre com ele.

source: Creates a new empty NetBeans Module.
pt_br: Cria um novo Módulo NetBeans vazio.

source: Use this template to add a new template to the New Project wizard.
pt_br: Usse esse modelo para adicionar um novo modelo para o Novo Projeto assistente.

source: This could be used to bundle sample applications that use a special technology, or to set up some complex project infrastructure (such as for a freeform project).
pt_br: Esse poderá ser usado para empacotar amostra de aplicações que usa uma tecnologia especial, ou para montar alguma infraestrutura complexa de projeto(assim com para um projeto de forma livre).

source: Makes a NetBeans action (CallableSystemAction or CookieAction) which can be added to a menu, context menu, toolbar, etc.
pt_br: Faça uma action NetBeans (CallableSystemAction ou CookieAction) que pode ser adicionada ao menu, menu de contexto, barra de ferramentas, etc.

source: &Add...
pt_br: &Adicionar...

source: Add...
pt_br: Adicionar...

source: A&dd...
pt_br: A&dicionar...

source: &Edit...
pt_br: &Editar...

source: &Remove
pt_br: &Remover

source: Remo&ve
pt_br: Remo&ver

source: Project Properties - {0}
pt_br: Propriedades do projeto - {0}

source: Invalid Platform is Selected (Cannot List Module Dependencies)
pt_br: Está Selecionada um Plataforma Inválida (Não é Possível Listar as Dependências do Módulo)

source: {0} platform not found; switching to default.
pt_br: {0} plataforma não econtrada; mudando para a padrão.

source: Previously set
pt_br: Definida anteriormente

source: Display
pt_br: Exibir

source: Sources
pt_br: Códigos-fonte

source: API Versioning
pt_br: Versionamento de APIs

source: Module List
pt_br: Lista de Módulos

source: Splash Screen
pt_br: Tela Inicial

source: Application
pt_br: Aplicativo

source: Compiling
pt_br: Compilação

source: Packaging
pt_br: Empacotamento

source: Module &Suite:
pt_br: &Suíte de Módulos:

source: Source &Level:
pt_br: Níve&l de Código:

source: Suite &Modules:
pt_br: &Módulos da Suíte:

source: &Add Dependency...
pt_br: &Adicionar Dependência...

source: Add New &Library...
pt_br: Adicionar Nova Bib&lioteca...

source: Export Packages Only to &Friends:
pt_br: Exportar Pacotes Apenas para Pacotes &Amigáveis:

source: &Manage Platforms...
pt_br: Gerenciar Platafor&mas...

source: M&odule Dependencies:
pt_br: Dependências do M&ódulo:

source: Provided Tokens:
pt_br: Símbolos Fornecidos:

source: Provided &Tokens:
pt_br: Símbolos &Fornecidos:

source: Re&quired Tokens:
pt_br: Símbolos Re&queridos :

source: You must select at least one public package to export to friends.
pt_br: Deve ser selecionado pelo menos um pacote público para exportação para os pacotes amigáveis.
